In [1]:
import pandas as pd
import numpy as np

In [2]:
dataliaison = pd.read_csv('../Data/raw_data/liaison.csv')

In [3]:
dataliaison

     product_id   id_web
0          3847    15298
1          3849    15296
2          3850    15300
3          4032    19814
4          4039    19815
..          ...      ...
820        7203      NaN
821        7204      NaN
822        7247  13127-1
823        7329  14680-1
824        7338    16230

[825 rows x 2 columns]

In [4]:
dataliaison.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 825 entries, 0 to 824
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   product_id  825 non-null    int64
 1   id_web      734 non-null    object
dtypes: int64(1), object(1)
memory usage: 13.0+ KB

# Vérification et traitement des valeurs null (NaN)

In [5]:
# Recherche des valeurs null (NaN)

print(dataliaison.isnull().sum())

product_id     0
id_web        91
dtype: int64

In [6]:
# Suppression des valeurs null (NaN)

dataliaison = dataliaison.dropna()
dataliaison

     product_id   id_web
0          3847    15298
1          3849    15296
2          3850    15300
3          4032    19814
4          4039    19815
..          ...      ...
792        7023    15891
793        7025    15887
822        7247  13127-1
823        7329  14680-1
824        7338    16230

[734 rows x 2 columns]

# Vérification et traitement des doublons

In [7]:
# Recherche des doublons

dataliaison.loc[dataliaison['id_web'].duplicated(keep=False),:]

Empty DataFrame
Columns: [product_id, id_web]
Index: []

In [8]:
dataliaison[dataliaison['id_web'] == 'bon-cadeau-25-euros']

     product_id               id_web
443        4954  bon-cadeau-25-euros

# Création d'une copie nettoyer

In [9]:
dataliaison.to_csv('../Data/processed_data/liaison_V2.csv', index=False)